scripts/dev/cold_plate/conjugate_verification/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// A 1 mm channel between two 0.5 mm solid slabs, 100 mm long, 2D.
// NX, NYF (fluid) and NYS (each solid) are substituted by run_case.sh.
scale 0.001;  // millimetres

vertices
(
    (0 -0.5 0) (100 -0.5 0) (100 0 0) (0 0 0)
    (0 1 0) (100 1 0) (0 1.5 0) (100 1.5 0)
    (0 -0.5 0.1) (100 -0.5 0.1) (100 0 0.1) (0 0 0.1)
    (0 1 0.1) (100 1 0.1) (0 1.5 0.1) (100 1.5 0.1)
);

blocks
(
    hex (0 1 2 3 8 9 10 11)   solidBottom (NX NYS 1) simpleGrading (1 1 1)
    hex (3 2 5 4 11 10 13 12) fluid       (NX NYF 1) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14) solidTop    (NX NYS 1) simpleGrading (1 1 1)
);

boundary
(
    inlet     { type patch; faces ((3 11 12 4)); }
    outlet    { type patch; faces ((2 5 13 10)); }
    solidEnds { type wall;  faces ((0 8 11 3) (1 2 10 9) (4 12 14 6) (5 7 15 13)); }
    heated    { type wall;  faces ((0 1 9 8) (6 14 15 7)); }
    frontAndBack
    {
        type empty;
        faces ((0 3 2 1) (3 4 5 2) (4 6 7 5) (8 9 10 11) (11 10 13 12) (12 13 15 14));
    }
);
