scripts/dev/cold_plate/conjugate_verification/constant/regionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionProperties;
}

regions
(
    fluid       (fluid)
    solid       (solidBottom solidTop)
);
