scripts/dev/cold_plate/conjugate_verification/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;
boundaryField
{
    ".*" { type calculated; value uniform 300; }
    frontAndBack { type empty; }
}
