scripts/dev/cold_plate/conjugate_verification/system/fluid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    rho           { solver PCG; preconditioner DIC; tolerance 1e-9; relTol 0; }
    p_rgh         { solver GAMG; smoother GaussSeidel; tolerance 1e-9; relTol 0.01; }
    "(U|h)"       { solver PBiCGStab; preconditioner DILU; tolerance 1e-11; relTol 0.01; }
}
SIMPLE
{
    momentumPredictor   on;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           1e5;
}
relaxationFactors
{
    fields    { rho 1.0; p_rgh 0.7; }
    equations { U 0.7; h 0.9; }
}
