scripts/dev/cold_plate/conjugate_verification/system/solidTop/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    h { solver PCG; preconditioner DIC; tolerance 1e-11; relTol 0.01; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
}
relaxationFactors { equations { h 0.9; } }
